app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @todo = Todo.find(params[:id])

SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" WHERE "todos"."completed" = 'f'
---
  def new
    @todos = Todo.all
    @complete_todos = Todo.where(:completed => true)

INSERT INTO "todos" ("completed", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["completed", false], ["created_at", Wed, 01 May 2013 02:35:29 UTC +00:00], ["name", "Get Milk"], ["updated_at", Wed, 01 May 2013 02:35:29 UTC +00:00]]
---
  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "14"]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 14]]
---
  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy